Revit 2027 API
ConduitSizeSettings.RemoveConduitStandardType Method
 Erases the existing ConduitSizes with this conduit standard name; the consuit standard type can not be removed if it is in use.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RemoveConduitStandardType(
	Document pADoc,
	string standardName
)
Public Function RemoveConduitStandardType (
	pADoc As Document,
	standardName As String
) As Boolean
public:
bool RemoveConduitStandardType(
	Document^ pADoc,
	String^ standardName
)
member RemoveConduitStandardType :
        pADoc : Document *
        standardName : string -> bool
Parameters
pADoc Document
 The document.
standardName String
 The conduit standard name.
Return Value
Boolean
 True if removing success; otherwise false.
Exceptions
Exception | Condition
ArgumentException |  The conduit standard is already in use. -or- The conduit standard is the last one.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace